// ============================================================
// 函数名称: sub_477550
// 起始地址: 0x477550
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00477550    mov edx, 0x03
00477555    mov ecx, 0x8352C8
0047755A    call 0x0069F030                                 ; => [ String: res/card_gen/shared/ico_coin.texture | Call: sub_69f030 ]
0047755F    mov dword ptr ds:[0x0171D898], eax              ; => [ Data: data_171d898 ]
00477564    ret
