// ============================================================
// 函数名称: sub_771090
// 起始地址: 0x771090
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00771090    mov eax, dword ptr ss:[ebp-0x10]
00771093    and eax, 0x01
00771096    jz 0x007710A8
0077109C    and dword ptr ss:[ebp-0x10], 0xFFFFFFFE
007710A0    mov ecx, dword ptr ss:[ebp-0x14]
007710A3    jmp 0x004AB280                                  ; => [ Call: sub_4ab280 ]
007710A8    ret
