// ============================================================
// 函数名称: sub_766726
// 起始地址: 0x766726
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766726    push 0x4F8780
0076672B    push 0x02
0076672D    push 0x30
0076672F    lea eax, ss:[ebp-0x70]
00766732    push eax
00766733    call 0x007592FC
00766738    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
