// ============================================================
// 函数名称: sub_475380
// 起始地址: 0x475380
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00475380    mov edx, 0x03
00475385    mov ecx, 0x831008
0047538A    call 0x0069F030                                 ; => [ String: res/card_gen/promo/summon-1.texture | Call: sub_69f030 ]
0047538F    mov dword ptr ds:[0x0171D5D0], eax              ; => [ Data: data_171d5d0 ]
00475394    ret
