// ============================================================
// 函数名称: sub_4845a0
// 起始地址: 0x4845a0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004845A0    mov edx, 0x22
004845A5    mov ecx, 0x853FEC
004845AA    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_3.ui2 | Call: sub_69f030 ]
004845AF    mov dword ptr ds:[0x0171E8B0], eax              ; => [ Data: data_171e8b0 ]
004845B4    ret
