// ============================================================
// 函数名称: sub_5023e0
// 起始地址: 0x5023e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005023E0    dword 6AD233
005023E4    lea ecx, ds:[edx+0x02]
005023E7    call 0x00561AF0                                 ; => [ Call: sub_561af0 ]
005023EC    add esp, 0x04
005023EF    mov ecx, 0x1023
005023F4    jmp 0x004FEBE0                                  ; => [ Call: sub_4febe0 ]
