// ============================================================
// 函数名称: sub_484340
// 起始地址: 0x484340
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484340    mov edx, 0x22
00484345    mov ecx, 0x853DB0
0048434A    call 0x0069F030                                 ; => [ String: res/ui2/options.ui2 | Call: sub_69f030 ]
0048434F    mov dword ptr ds:[0x0171E86C], eax              ; => [ Data: data_171e86c ]
00484354    ret
