// ============================================================
// 函数名称: sub_768240
// 起始地址: 0x768240
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768240    mov eax, dword ptr ss:[ebp-0x7C]
00768243    and eax, 0x01
00768246    jz 0x00768258
0076824C    and dword ptr ss:[ebp-0x7C], 0xFFFFFFFE
00768250    mov ecx, dword ptr ss:[ebp-0x6C]
00768253    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00768258    ret
