// ============================================================
// 函数名称: sub_484980
// 起始地址: 0x484980
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484980    mov edx, 0x22
00484985    mov ecx, 0x8543E0
0048498A    call 0x0069F030                                 ; => [ String: res/ui2/rules_plun_plunder_1.ui2 | Call: sub_69f030 ]
0048498F    mov dword ptr ds:[0x0171E924], eax              ; => [ Data: data_171e924 ]
00484994    ret
