// ============================================================
// 函数名称: sub_770885
// 起始地址: 0x770885
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770885    mov eax, dword ptr ss:[ebp-0x128]
0077088B    and eax, 0x40
0077088E    jz 0x007708A6
00770894    and dword ptr ss:[ebp-0x128], 0xFFFFFFBF
0077089B    lea ecx, ss:[ebp-0x11C]
007708A1    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007708A6    ret
