// ============================================================
// 函数名称: sub_4a83f0
// 起始地址: 0x4a83f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A83F0    push 0x801800
004A83F5    push 0x00
004A83F7    push 0x00
004A83F9    push 0x00
004A83FB    push 0x22
004A83FD    mov ecx, 0x1777507
004A8402    call 0x006B7CB0
004A8407    ret                                             ; => [ Data: data_801800 | Call: sub_6b7cb0 ]
