// ============================================================
// 函数名称: sub_766713
// 起始地址: 0x766713
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766713    push 0x4F8780
00766718    push 0x02
0076671A    push 0x30
0076671C    lea eax, ss:[ebp-0x70]
0076671F    push eax
00766720    call 0x007592FC
00766725    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
