// ============================================================
// 函数名称: sub_484480
// 起始地址: 0x484480
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484480    mov edx, 0x22
00484485    mov ecx, 0x853EE0
0048448A    call 0x0069F030                                 ; => [ String: res/ui2/rules_adventures_1.ui2 | Call: sub_69f030 ]
0048448F    mov dword ptr ds:[0x0171E88C], eax              ; => [ Data: data_171e88c ]
00484494    ret
