// ============================================================
// 函数名称: sub_766120
// 起始地址: 0x766120
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766120    push 0x4F8780
00766125    push 0x04
00766127    push 0x30
00766129    lea eax, ss:[ebp-0xD0]
0076612F    push eax
00766130    call 0x007592FC
00766135    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
