// ============================================================
// 函数名称: sub_767790
// 起始地址: 0x767790
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767790    mov eax, dword ptr ss:[ebp-0x14]
00767793    and eax, 0x01
00767796    jz 0x007677A8
0076779C    and dword ptr ss:[ebp-0x14], 0xFFFFFFFE
007677A0    mov ecx, dword ptr ss:[ebp-0x18]
007677A3    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007677A8    ret
