// ============================================================
// 函数名称: sub_475070
// 起始地址: 0x475070
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00475070    mov edx, 0x03
00475075    mov ecx, 0x830C34
0047507A    call 0x0069F030                                 ; => [ String: res/card_gen/plunder/shy.texture | Call: sub_69f030 ]
0047507F    mov dword ptr ds:[0x0171D570], eax              ; => [ Data: data_171d570 ]
00475084    ret
