// ============================================================
// 函数名称: sub_535b80
// 起始地址: 0x535b80
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00535B80    push ecx
00535B81    mov eax, esp
00535B83    mov edx, 0x02
00535B88    mov ecx, 0x476
00535B8D    mov dword ptr ds:[eax], 0x04
00535B93    call 0x00564CE0
00535B98    pop ecx
00535B99    ret                                             ; => [ Call: sub_564ce0 ]
