// ============================================================
// 函数名称: sub_484740
// 起始地址: 0x484740
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484740    mov edx, 0x22
00484745    mov ecx, 0x854180
0048474A    call 0x0069F030                                 ; => [ String: res/ui2/rules_empires_4.ui2 | Call: sub_69f030 ]
0048474F    mov dword ptr ds:[0x0171E8E0], eax              ; => [ Data: data_171e8e0 ]
00484754    ret
