// ============================================================
// 函数名称: sub_475540
// 起始地址: 0x475540
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00475540    mov edx, 0x03
00475545    mov ecx, 0x831250
0047554A    call 0x0069F030                                 ; => [ String: res/card_gen/prosperity/mint.texture | Call: sub_69f030 ]
0047554F    mov dword ptr ds:[0x0171D608], eax              ; => [ Data: data_171d608 ]
00475554    ret
