// ============================================================
// 函数名称: sub_474970
// 起始地址: 0x474970
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00474970    mov edx, 0x03
00474975    mov ecx, 0x830398
0047497A    call 0x0069F030                                 ; => [ String: res/card_gen/plunder/fated.texture | Call: sub_69f030 ]
0047497F    mov dword ptr ds:[0x0171D490], eax              ; => [ Data: data_171d490 ]
00474984    ret
