// ============================================================
// 函数名称: sub_484760
// 起始地址: 0x484760
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484760    mov edx, 0x22
00484765    mov ecx, 0x85419C
0048476A    call 0x0069F030                                 ; => [ String: res/ui2/rules_empires_5.ui2 | Call: sub_69f030 ]
0048476F    mov dword ptr ds:[0x0171E8E4], eax              ; => [ Data: data_171e8e4 ]
00484774    ret
