// ============================================================
// 函数名称: sub_763378
// 起始地址: 0x763378
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00763378    mov eax, dword ptr ss:[ebp-0x54]
0076337B    and eax, 0x01
0076337E    jz 0x00763390
00763384    and dword ptr ss:[ebp-0x54], 0xFFFFFFFE
00763388    lea ecx, ss:[ebp-0x50]
0076338B    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00763390    ret
