// ============================================================
// 函数名称: sub_767600
// 起始地址: 0x767600
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767600    mov eax, dword ptr ss:[ebp-0x14]
00767603    and eax, 0x01
00767606    jz 0x00767618
0076760C    and dword ptr ss:[ebp-0x14], 0xFFFFFFFE
00767610    mov ecx, dword ptr ss:[ebp-0x18]
00767613    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00767618    ret
