// ============================================================
// 函数名称: sub_77130a
// 起始地址: 0x77130a
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0077130A    mov eax, dword ptr ss:[ebp-0x10]
0077130D    and eax, 0x2000
00771312    jz 0x00771327
00771318    and dword ptr ss:[ebp-0x10], 0xFFFFDFFF
0077131F    lea ecx, ss:[ebp-0x14]
00771322    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00771327    ret
