// ============================================================
// 函数名称: sub_4846e0
// 起始地址: 0x4846e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004846E0    mov edx, 0x22
004846E5    mov ecx, 0x85412C
004846EA    call 0x0069F030                                 ; => [ String: res/ui2/rules_empires_1.ui2 | Call: sub_69f030 ]
004846EF    mov dword ptr ds:[0x0171E8D4], eax              ; => [ Data: data_171e8d4 ]
004846F4    ret
