// ============================================================
// 函数名称: sub_484520
// 起始地址: 0x484520
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484520    mov edx, 0x22
00484525    mov ecx, 0x853F7C
0048452A    call 0x0069F030                                 ; => [ String: res/ui2/rules_alchemy_2.ui2 | Call: sub_69f030 ]
0048452F    mov dword ptr ds:[0x0171E8A0], eax              ; => [ Data: data_171e8a0 ]
00484534    ret
