// ============================================================
// 函数名称: sub_766700
// 起始地址: 0x766700
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766700    push 0x4F8780
00766705    push 0x02
00766707    push 0x30
00766709    lea eax, ss:[ebp-0x70]
0076670C    push eax
0076670D    call 0x007592FC
00766712    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
