// ============================================================
// 函数名称: sub_484010
// 起始地址: 0x484010
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484010    mov edx, 0x22
00484015    mov ecx, 0x853A14
0048401A    call 0x0069F030                                 ; => [ String: res/ui2/how_to_play.ui2 | Call: sub_69f030 ]
0048401F    mov dword ptr ds:[0x0171E81C], eax              ; => [ Data: data_171e81c ]
00484024    ret
