// ============================================================
// 函数名称: sub_484630
// 起始地址: 0x484630
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484630    mov edx, 0x22
00484635    mov ecx, 0x854078
0048463A    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_8.ui2 | Call: sub_69f030 ]
0048463F    mov dword ptr ds:[0x0171E8C0], eax              ; => [ Data: data_171e8c0 ]
00484644    ret
