// ============================================================
// 函数名称: sub_474870
// 起始地址: 0x474870
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00474870    mov edx, 0x03
00474875    mov ecx, 0x830258
0047487A    call 0x0069F030                                 ; => [ String: res/card_gen/plunder/crew.texture | Call: sub_69f030 ]
0047487F    mov dword ptr ds:[0x0171D470], eax              ; => [ Data: data_171d470 ]
00474884    ret
