// ============================================================
// 函数名称: sub_767728
// 起始地址: 0x767728
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767728    mov eax, dword ptr ss:[ebp-0x14]
0076772B    and eax, 0x10
0076772E    jz 0x00767740
00767734    and dword ptr ss:[ebp-0x14], 0xFFFFFFEF
00767738    lea ecx, ss:[ebp-0x38]
0076773B    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00767740    ret
