// ============================================================
// 函数名称: sub_771628
// 起始地址: 0x771628
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00771628    mov eax, dword ptr ss:[ebp-0x14]
0077162B    and eax, 0x01
0077162E    jz 0x00771640
00771634    and dword ptr ss:[ebp-0x14], 0xFFFFFFFE
00771638    mov ecx, dword ptr ss:[ebp-0x10]
0077163B    jmp 0x004AB280                                  ; => [ Call: sub_4ab280 ]
00771640    ret
