// ============================================================
// 函数名称: sub_4785e0
// 起始地址: 0x4785e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004785E0    mov edx, 0x15
004785E5    mov ecx, 0x837D44
004785EA    call 0x0069F030                                 ; => [ String: res/music/alchemy.sound | Call: sub_69f030 ]
004785EF    mov dword ptr ds:[0x0171D904], eax              ; => [ Data: data_171d904 ]
004785F4    ret
