// ============================================================
// 函数名称: sub_518c20
// 起始地址: 0x518c20
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00518C20    dword CC97B8B8                                  ; => [ Data: data_cc97b8 ]
00518C24    add byte ptr ds:[ebx+0x74C98508], cl
00518C2A    jnb 0x0DC59229
00518C30    add eax, 0x10
00518C33    cmp eax, 0xCC99B8
00518C38    jl 0x00518C25
00518C3A    xor al, al
00518C3C    ret
00518C3D    mov al, 0x01
00518C3F    ret
