// ============================================================
// 函数名称: sub_767880
// 起始地址: 0x767880
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767880    mov eax, dword ptr ss:[ebp-0x10]
00767883    and eax, 0x01
00767886    jz 0x00767898
0076788C    and dword ptr ss:[ebp-0x10], 0xFFFFFFFE
00767890    mov ecx, dword ptr ss:[ebp-0x14]
00767893    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00767898    ret
