// ============================================================
// 函数名称: sub_5307e0
// 起始地址: 0x5307e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005307E0    xor edx, edx
005307E2    push ecx
005307E3    push 0x00
005307E5    lea ecx, ds:[edx+0x03]
005307E8    call 0x00561E00
005307ED    add esp, 0x04
005307F0    mov edx, 0xC1C
005307F5    call 0x0052BE60
005307FA    pop ecx
005307FB    ret                                             ; => [ Call: sub_52be60 | Call: sub_561e00 ]
