// ============================================================
// 函数名称: sub_770150
// 起始地址: 0x770150
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770150    mov eax, dword ptr ss:[ebp-0x1C]
00770153    and eax, 0x01
00770156    jz 0x00770168
0077015C    and dword ptr ss:[ebp-0x1C], 0xFFFFFFFE
00770160    mov ecx, dword ptr ss:[ebp-0x20]
00770163    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770168    ret
