// ============================================================
// 函数名称: sub_52d230
// 起始地址: 0x52d230
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0052D230    dword 83EC8B55
0052D234    in al, 0xF8
0052D236    push ecx
0052D237    push 0x00
0052D239    push 0x10000
0052D23E    xor edx, edx
0052D240    xor ecx, ecx
0052D242    call 0x00568960
0052D247    add esp, 0x0C
0052D24A    mov esp, ebp
0052D24C    pop ebp
0052D24D    ret                                             ; => [ Call: sub_568960 ]
