// ============================================================
// 函数名称: sub_557280
// 起始地址: 0x557280
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00557280    dword 83EC8B55
00557284    in al, 0xF8
00557286    xor edx, edx
00557288    lea ecx, ds:[edx+0x01]
0055728B    call 0x005621A0                                 ; => [ Call: sub_5621a0 ]
00557290    xor edx, edx
00557292    lea ecx, ds:[edx+0x01]
00557295    call 0x00562360
0055729A    mov esp, ebp
0055729C    pop ebp
0055729D    ret                                             ; => [ Call: sub_562360 ]
