// ============================================================
// 函数名称: sub_472660
// 起始地址: 0x472660
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00472660    mov edx, 0x03
00472665    mov ecx, 0x82D340
0047266A    call 0x0069F030                                 ; => [ String: res/card_gen/empires/landmark-22.texture | Call: sub_69f030 ]
0047266F    mov dword ptr ds:[0x0171D034], eax              ; => [ Data: data_171d034 ]
00472674    ret
