// ============================================================
// 函数名称: sub_548010
// 起始地址: 0x548010
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00548010    call 0x0056B800                                 ; => [ Call: sub_56b800 ]
00548015    push ecx
00548016    mov edx, 0x3E9
0054801B    mov ecx, eax
0054801D    call 0x005624A0                                 ; => [ Call: sub_5624a0 ]
00548022    add esp, 0x04
00548025    mov ecx, 0x476
0054802A    jmp 0x00547860                                  ; => [ Call: sub_547860 ]
