// ============================================================
// 函数名称: sub_4840a0
// 起始地址: 0x4840a0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004840A0    mov edx, 0x22
004840A5    mov ecx, 0x853AB0
004840AA    call 0x0069F030                                 ; => [ String: res/ui2/input_box.ui2 | Call: sub_69f030 ]
004840AF    mov dword ptr ds:[0x0171E828], eax              ; => [ Data: data_171e828 ]
004840B4    ret
