// ============================================================
// 函数名称: sub_771960
// 起始地址: 0x771960
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00771960    mov eax, dword ptr ss:[ebp-0x10]
00771963    and eax, 0x01
00771966    jz 0x00771978
0077196C    and dword ptr ss:[ebp-0x10], 0xFFFFFFFE
00771970    mov ecx, dword ptr ss:[ebp-0x28]
00771973    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00771978    ret
