// ============================================================
// 函数名称: sub_4a8370
// 起始地址: 0x4a8370
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A8370    push 0x801800
004A8375    push 0x00
004A8377    push 0x00
004A8379    push 0x00
004A837B    push 0x1E
004A837D    mov ecx, 0x1724A8F
004A8382    call 0x006B7CB0
004A8387    ret                                             ; => [ Data: data_801800 | Call: sub_6b7cb0 ]
