// ============================================================
// 函数名称: sub_763720
// 起始地址: 0x763720
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00763720    mov eax, dword ptr ss:[ebp-0x10]
00763723    and eax, 0x01
00763726    jz 0x00763738
0076372C    and dword ptr ss:[ebp-0x10], 0xFFFFFFFE
00763730    mov ecx, dword ptr ss:[ebp-0x14]
00763733    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00763738    ret
