// ============================================================
// 函数名称: sub_4c7290
// 起始地址: 0x4c7290
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004C7290    dword B4358B56
004C7294    mov edi, 0xD233008D
004C7299    mov ecx, esi
004C729B    call 0x004B8F10                                 ; => [ Call: sub_4b8f10 ]
004C72A0    mov ecx, esi
004C72A2    pop esi
004C72A3    jmp 0x004BC4B0                                  ; => [ Call: sub_4bc4b0 ]
