// ============================================================
// 函数名称: sub_484190
// 起始地址: 0x484190
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484190    mov edx, 0x22
00484195    mov ecx, 0x853BA4
0048419A    call 0x0069F030                                 ; => [ String: res/ui2/main_layout.ui2 | Call: sub_69f030 ]
0048419F    mov dword ptr ds:[0x0171E840], eax              ; => [ Data: data_171e840 ]
004841A4    ret
