// ============================================================
// 函数名称: sub_484560
// 起始地址: 0x484560
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484560    mov edx, 0x22
00484565    mov ecx, 0x853FB4
0048456A    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_1a.ui2 | Call: sub_69f030 ]
0048456F    mov dword ptr ds:[0x0171E8A8], eax              ; => [ Data: data_171e8a8 ]
00484574    ret
