// ============================================================
// 函数名称: sub_767340
// 起始地址: 0x767340
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767340    push 0x4F8780
00767345    push 0x02
00767347    push 0x30
00767349    lea eax, ss:[ebp-0x70]
0076734C    push eax
0076734D    call 0x007592FC
00767352    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
