// ============================================================
// 函数名称: sub_76b709
// 起始地址: 0x76b709
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076B709    mov eax, dword ptr ss:[ebp-0x14]
0076B70C    and eax, 0x02
0076B70F    jz 0x0076B721
0076B715    and dword ptr ss:[ebp-0x14], 0xFFFFFFFD
0076B719    lea ecx, ss:[ebp-0x24]
0076B71C    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076B721    ret
