// ============================================================
// 函数名称: sub_7676a1
// 起始地址: 0x7676a1
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007676A1    mov eax, dword ptr ss:[ebp-0x18]
007676A4    and eax, 0x02
007676A7    jz 0x007676B9
007676AD    and dword ptr ss:[ebp-0x18], 0xFFFFFFFD
007676B1    lea ecx, ss:[ebp-0x14]
007676B4    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007676B9    ret
