// ============================================================
// 函数名称: sub_4843f0
// 起始地址: 0x4843f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004843F0    mov edx, 0x22
004843F5    mov ecx, 0x853E68
004843FA    call 0x0069F030                                 ; => [ String: res/ui2/profile.ui2 | Call: sub_69f030 ]
004843FF    mov dword ptr ds:[0x0171E87C], eax              ; => [ Data: data_171e87c ]
00484404    ret
