// ============================================================
// 函数名称: sub_484580
// 起始地址: 0x484580
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484580    mov edx, 0x22
00484585    mov ecx, 0x853FD0
0048458A    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_2.ui2 | Call: sub_69f030 ]
0048458F    mov dword ptr ds:[0x0171E8AC], eax              ; => [ Data: data_171e8ac ]
00484594    ret
