// ============================================================
// 函数名称: sub_478470
// 起始地址: 0x478470
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478470    mov edx, 0x25
00478475    mov ecx, 0x837AB0
0047847A    call 0x0069F030                                 ; => [ String: res/font/ko_tmonblack.truetype | Call: sub_69f030 ]
0047847F    mov dword ptr ds:[0x0171D8F0], eax              ; => [ Data: data_171d8f0 ]
00478484    ret
