// ============================================================
// 函数名称: sub_76a029
// 起始地址: 0x76a029
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076A029    mov eax, dword ptr ss:[ebp-0x14]
0076A02C    and eax, 0x02
0076A02F    jz 0x0076A041
0076A035    and dword ptr ss:[ebp-0x14], 0xFFFFFFFD
0076A039    lea ecx, ss:[ebp-0x24]
0076A03C    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076A041    ret
