// ============================================================
// 函数名称: sub_478810
// 起始地址: 0x478810
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478810    mov edx, 0x03
00478815    mov ecx, 0x838044
0047881A    call 0x0069F030                                 ; => [ String: res/non_atlas/gamebg_empires.texture | Call: sub_69f030 ]
0047881F    mov dword ptr ds:[0x0171D930], eax              ; => [ Data: data_171d930 ]
00478824    ret
