// ============================================================
// 函数名称: sub_484610
// 起始地址: 0x484610
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484610    mov edx, 0x22
00484615    mov ecx, 0x85405C
0048461A    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_7.ui2 | Call: sub_69f030 ]
0048461F    mov dword ptr ds:[0x0171E8BC], eax              ; => [ Data: data_171e8bc ]
00484624    ret
