// ============================================================
// 函数名称: sub_484230
// 起始地址: 0x484230
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484230    mov edx, 0x22
00484235    mov ecx, 0x853C44
0048423A    call 0x0069F030                                 ; => [ String: res/ui2/missing_content.ui2 | Call: sub_69f030 ]
0048423F    mov dword ptr ds:[0x0171E854], eax              ; => [ Data: data_171e854 ]
00484244    ret
