// ============================================================
// 函数名称: sub_770348
// 起始地址: 0x770348
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770348    mov eax, dword ptr ss:[ebp-0x10]
0077034B    and eax, 0x01
0077034E    jz 0x00770360
00770354    and dword ptr ss:[ebp-0x10], 0xFFFFFFFE
00770358    mov ecx, dword ptr ss:[ebp-0x14]
0077035B    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770360    ret
