// ============================================================
// 函数名称: sub_484650
// 起始地址: 0x484650
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484650    mov edx, 0x22
00484655    mov ecx, 0x854094
0048465A    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_9.ui2 | Call: sub_69f030 ]
0048465F    mov dword ptr ds:[0x0171E8C4], eax              ; => [ Data: data_171e8c4 ]
00484664    ret
