// ============================================================
// 函数名称: sub_484870
// 起始地址: 0x484870
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484870    mov edx, 0x22
00484875    mov ecx, 0x8542C0
0048487A    call 0x0069F030                                 ; => [ String: res/ui2/rules_menagerie_2.ui2 | Call: sub_69f030 ]
0048487F    mov dword ptr ds:[0x0171E904], eax              ; => [ Data: data_171e904 ]
00484884    ret
