// ============================================================
// 函数名称: sub_7719a1
// 起始地址: 0x7719a1
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007719A1    mov eax, dword ptr ss:[ebp-0x10]
007719A4    and eax, 0x04
007719A7    jz 0x007719B9
007719AD    and dword ptr ss:[ebp-0x10], 0xFFFFFFFB
007719B1    lea ecx, ss:[ebp-0x20]
007719B4    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007719B9    ret
