// ============================================================
// 函数名称: sub_484810
// 起始地址: 0x484810
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484810    mov edx, 0x22
00484815    mov ecx, 0x854260
0048481A    call 0x0069F030                                 ; => [ String: res/ui2/rules_hinterlands_1.ui2 | Call: sub_69f030 ]
0048481F    mov dword ptr ds:[0x0171E8F8], eax              ; => [ Data: data_171e8f8 ]
00484824    ret
