// ============================================================
// 函数名称: sub_766739
// 起始地址: 0x766739
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766739    push 0x4F8780
0076673E    push 0x02
00766740    push 0x30
00766742    lea eax, ss:[ebp-0x70]
00766745    push eax
00766746    call 0x007592FC
0076674B    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
