// ============================================================
// 函数名称: sub_484b00
// 起始地址: 0x484b00
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484B00    mov edx, 0x22
00484B05    mov ecx, 0x854588
00484B0A    call 0x0069F030                                 ; => [ String: res/ui2/scorescreen.ui2 | Call: sub_69f030 ]
00484B0F    mov dword ptr ds:[0x0171E950], eax              ; => [ Data: data_171e950 ]
00484B14    ret
