// ============================================================
// 函数名称: sub_484850
// 起始地址: 0x484850
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484850    mov edx, 0x22
00484855    mov ecx, 0x8542A0
0048485A    call 0x0069F030                                 ; => [ String: res/ui2/rules_menagerie_1.ui2 | Call: sub_69f030 ]
0048485F    mov dword ptr ds:[0x0171E900], eax              ; => [ Data: data_171e900 ]
00484864    ret
