// ============================================================
// 函数名称: sub_484670
// 起始地址: 0x484670
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484670    mov edx, 0x22
00484675    mov ecx, 0x8540B0
0048467A    call 0x0069F030                                 ; => [ String: res/ui2/rules_cornucopia_1.ui2 | Call: sub_69f030 ]
0048467F    mov dword ptr ds:[0x0171E8C8], eax              ; => [ Data: data_171e8c8 ]
00484684    ret
