// ============================================================
// 函数名称: sub_484700
// 起始地址: 0x484700
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484700    mov edx, 0x22
00484705    mov ecx, 0x854148
0048470A    call 0x0069F030                                 ; => [ String: res/ui2/rules_empires_2.ui2 | Call: sub_69f030 ]
0048470F    mov dword ptr ds:[0x0171E8D8], eax              ; => [ Data: data_171e8d8 ]
00484714    ret
