// ============================================================
// 函数名称: sub_475520
// 起始地址: 0x475520
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00475520    mov edx, 0x03
00475525    mov ecx, 0x831228
0047552A    call 0x0069F030                                 ; => [ String: res/card_gen/prosperity/loan.texture | Call: sub_69f030 ]
0047552F    mov dword ptr ds:[0x0171D604], eax              ; => [ Data: data_171d604 ]
00475534    ret
