// ============================================================
// 函数名称: sub_474830
// 起始地址: 0x474830
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00474830    mov edx, 0x03
00474835    mov ecx, 0x830210
0047483A    call 0x0069F030                                 ; => [ String: res/card_gen/plunder/cage.texture | Call: sub_69f030 ]
0047483F    mov dword ptr ds:[0x0171D468], eax              ; => [ Data: data_171d468 ]
00474844    ret
