// ============================================================
// 函数名称: sub_543100
// 起始地址: 0x543100
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00543100    push ecx
00543101    mov eax, esp
00543103    xor edx, edx
00543105    mov ecx, 0x3EA
0054310A    mov dword ptr ds:[eax], 0x04
00543110    call 0x00564CE0
00543115    pop ecx
00543116    ret                                             ; => [ Call: sub_564ce0 ]
