// ============================================================
// 函数名称: sub_556f00
// 起始地址: 0x556f00
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00556F00    mov ecx, 0x01
00556F05    call 0x0056E9C0
00556F0A    xor edx, edx
00556F0C    push 0x00
00556F0E    lea ecx, ds:[edx+0x02]
00556F11    call 0x00561AF0
00556F16    pop ecx
00556F17    ret                                             ; => [ Call: sub_56e9c0 | Call: sub_561af0 ]
