// ============================================================
// 函数名称: sub_6655e0
// 起始地址: 0x6655e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

006655E0    cmp byte ptr ds:[ecx+0x05], 0x00
006655E4    jnz 0x006655F6
006655E6    mov ecx, dword ptr ds:[ecx+0x1718]
006655EC    test ecx, ecx
006655EE    jz 0x006655F9
006655F0    cmp byte ptr ds:[ecx+0x05], 0x00
006655F4    jz 0x006655E6
006655F6    mov al, 0x01
006655F8    ret
006655F9    xor al, al
006655FB    ret
