// ============================================================
// 函数名称: sub_767920
// 起始地址: 0x767920
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767920    mov eax, dword ptr ss:[ebp-0x1C]
00767923    and eax, 0x01
00767926    jz 0x00767938
0076792C    and dword ptr ss:[ebp-0x1C], 0xFFFFFFFE
00767930    mov ecx, dword ptr ss:[ebp-0x20]
00767933    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00767938    ret
