// ============================================================
// 函数名称: sub_7707f3
// 起始地址: 0x7707f3
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007707F3    mov eax, dword ptr ss:[ebp-0x128]
007707F9    and eax, 0x10
007707FC    jz 0x00770814
00770802    and dword ptr ss:[ebp-0x128], 0xFFFFFFEF
00770809    lea ecx, ss:[ebp-0x11C]
0077080F    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770814    ret
