// ============================================================
// 函数名称: sub_4841f0
// 起始地址: 0x4841f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004841F0    mov edx, 0x22
004841F5    mov ecx, 0x853C10
004841FA    call 0x0069F030                                 ; => [ String: res/ui2/message_box.ui2 | Call: sub_69f030 ]
004841FF    mov dword ptr ds:[0x0171E84C], eax              ; => [ Data: data_171e84c ]
00484204    ret
