// ============================================================
// 函数名称: sub_4843a0
// 起始地址: 0x4843a0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004843A0    mov edx, 0x22
004843A5    mov ecx, 0x853E18
004843AA    call 0x0069F030                                 ; => [ String: res/ui2/pod_icons.ui2 | Call: sub_69f030 ]
004843AF    mov dword ptr ds:[0x0171E874], eax              ; => [ Data: data_171e874 ]
004843B4    ret
