// ============================================================
// 函数名称: sub_473160
// 起始地址: 0x473160
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00473160    mov edx, 0x03
00473165    mov ecx, 0x82E254
0047316A    call 0x0069F030                                 ; => [ String: res/card_gen/intrigue/baron.texture | Call: sub_69f030 ]
0047316F    mov dword ptr ds:[0x0171D190], eax              ; => [ Data: data_171d190 ]
00473174    ret
