// ============================================================
// 函数名称: sub_472640
// 起始地址: 0x472640
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00472640    mov edx, 0x03
00472645    mov ecx, 0x82D314
0047264A    call 0x0069F030                                 ; => [ String: res/card_gen/empires/landmark-16.texture | Call: sub_69f030 ]
0047264F    mov dword ptr ds:[0x0171D030], eax              ; => [ Data: data_171d030 ]
00472654    ret
