// ============================================================
// 函数名称: sub_4a8270
// 起始地址: 0x4a8270
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A8270    push 0x801800
004A8275    push 0x6D8A40
004A827A    push 0x6D8860
004A827F    push 0x00
004A8281    push 0x05
004A8283    mov ecx, 0x1597E77
004A8288    call 0x006B7CB0
004A828D    ret                                             ; => [ Call: sub_6d8860 | Data: data_801800 | Call: sub_6d8a40 | Call: sub_6b7cb0 ]
