// ============================================================
// 函数名称: sub_484210
// 起始地址: 0x484210
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484210    mov edx, 0x22
00484215    mov ecx, 0x853C28
0048421A    call 0x0069F030                                 ; => [ String: res/ui2/message_undo.ui2 | Call: sub_69f030 ]
0048421F    mov dword ptr ds:[0x0171E850], eax              ; => [ Data: data_171e850 ]
00484224    ret
