// ============================================================
// 函数名称: sub_7712ec
// 起始地址: 0x7712ec
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007712EC    mov eax, dword ptr ss:[ebp-0x10]
007712EF    and eax, 0x1000
007712F4    jz 0x00771309
007712FA    and dword ptr ss:[ebp-0x10], 0xFFFFEFFF
00771301    lea ecx, ss:[ebp-0x18]
00771304    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00771309    ret
