// ============================================================
// 函数名称: sub_768135
// 起始地址: 0x768135
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768135    mov eax, dword ptr ss:[ebp-0x84]
0076813B    and eax, 0x1000000                              ; => [ Data: data_1000000 ]
00768140    jz 0x00768158
00768146    and dword ptr ss:[ebp-0x84], 0xFEFFFFFF
00768150    mov ecx, dword ptr ss:[ebp-0x6C]
00768153    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00768158    ret
