// ============================================================
// 函数名称: sub_478660
// 起始地址: 0x478660
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478660    mov edx, 0x15
00478665    mov ecx, 0x837DEC
0047866A    call 0x0069F030                                 ; => [ String: res/music/dark_ages.sound | Call: sub_69f030 ]
0047866F    mov dword ptr ds:[0x0171D90C], eax              ; => [ Data: data_171d90c ]
00478674    ret
