// ============================================================
// 函数名称: sub_484c80
// 起始地址: 0x484c80
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484C80    mov edx, 0x22
00484C85    mov ecx, 0x85474C
00484C8A    call 0x0069F030                                 ; => [ String: res/ui2/style_sheet.ui2 | Call: sub_69f030 ]
00484C8F    mov dword ptr ds:[0x0171E970], eax              ; => [ Data: data_171e970 ]
00484C94    ret
