// ============================================================
// 函数名称: sub_762990
// 起始地址: 0x762990
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00762990    push 0x63D770
00762995    push 0x08
00762997    push 0x04
00762999    lea eax, ss:[ebp-0x54]
0076299C    push eax
0076299D    call 0x007592FC
007629A2    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_63d770 ]
