// ============================================================
// 函数名称: sub_5566f0
// 起始地址: 0x5566f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005566F0    dword 4A8DD233
005566F4    add al, 0xE8
005566F6    mov sp, 0x00
005566FA    call 0x0056B800                                 ; => [ Call: sub_56b800 ]
005566FF    push ecx
00556700    mov edx, 0x3E9
00556705    mov ecx, eax
00556707    call 0x005624A0
0055670C    pop ecx
0055670D    ret                                             ; => [ Call: sub_5624a0 ]
