// ============================================================
// 函数名称: sub_484120
// 起始地址: 0x484120
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484120    mov edx, 0x22
00484125    mov ecx, 0x853B48
0048412A    call 0x0069F030                                 ; => [ String: res/ui2/leaderboard.ui2 | Call: sub_69f030 ]
0048412F    mov dword ptr ds:[0x0171E834], eax              ; => [ Data: data_171e834 ]
00484134    ret
