// ============================================================
// 函数名称: sub_532360
// 起始地址: 0x532360
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00532360    dword 6A51D233
00532364    add byte ptr ss:[ebp-0x6C17FEB6], cl
0053236A    cli
0053236B    add al, byte ptr ds:[eax]
0053236D    add esp, 0x08
00532370    xor edx, edx
00532372    lea ecx, ds:[edx+0x07]
00532375    jmp 0x00562F10                                  ; => [ Call: sub_562f10 ]
