// ============================================================
// 函数名称: sub_50ec60
// 起始地址: 0x50ec60
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0050EC60    dword EC80B951
0050EC64    byte 50
0050EC65    byte 0
0050EC66    call 0x0050B730
0050EC6B    mov ecx, eax
0050EC6D    call 0x0050E690
0050EC72    pop ecx
0050EC73    ret                                             ; => [ Call: sub_50e690 | Call: sub_50b730 | Call: sub_50ec80 ]
