// ============================================================
// 函数名称: sub_771290
// 起始地址: 0x771290
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00771290    mov eax, dword ptr ss:[ebp-0x10]
00771293    and eax, 0x100
00771298    jz 0x007712AD
0077129E    and dword ptr ss:[ebp-0x10], 0xFFFFFEFF
007712A5    lea ecx, ss:[ebp-0x14]
007712A8    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007712AD    ret
