// ============================================================
// 函数名称: sub_527cd0
// 起始地址: 0x527cd0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00527CD0    dword 43B2BE8                                   ; => [ Call: sub_56b800 ]
00527CD4    add byte ptr ds:[ecx-0x46], dl
00527CD7    jmp far 0xE8C8:0x8B000003
00527CDE    mov esi, 0x590003A7
00527CE3    ret                                             ; => [ Call: sub_5624a0 ]
