// ============================================================
// 函数名称: sub_770858
// 起始地址: 0x770858
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770858    mov eax, dword ptr ss:[ebp-0x128]
0077085E    and eax, 0x20
00770861    jz 0x00770879
00770867    and dword ptr ss:[ebp-0x128], 0xFFFFFFDF
0077086E    lea ecx, ss:[ebp-0x11C]
00770874    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770879    ret
