// ============================================================
// 函数名称: sub_4a8310
// 起始地址: 0x4a8310
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A8310    push 0x801800
004A8315    push 0x6C25F0
004A831A    push 0x00
004A831C    push 0x6C32A0
004A8321    push 0x19
004A8323    mov ecx, 0x1724A8C
004A8328    call 0x006B7CB0
004A832D    ret                                             ; => [ Data: data_801800 | Call: sub_6c32a0 | Call: sub_6b7cb0 | Call: sub_6c25f0 ]
