// ============================================================
// 函数名称: sub_763569
// 起始地址: 0x763569
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00763569    mov eax, dword ptr ss:[ebp-0x14]
0076356C    and eax, 0x04
0076356F    jz 0x00763581
00763575    and dword ptr ss:[ebp-0x14], 0xFFFFFFFB
00763579    lea ecx, ss:[ebp-0x1C]
0076357C    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00763581    ret
