// ============================================================
// 函数名称: sub_771920
// 起始地址: 0x771920
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00771920    mov eax, dword ptr ss:[ebp-0x18]
00771923    and eax, 0x01
00771926    jz 0x00771938
0077192C    and dword ptr ss:[ebp-0x18], 0xFFFFFFFE
00771930    mov ecx, dword ptr ss:[ebp-0x10]
00771933    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00771938    ret
