// ============================================================
// 函数名称: sub_507820
// 起始地址: 0x507820
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00507820    dword 5B4DBE8                                   ; => [ Call: sub_562d00 ]
00507824    add byte ptr ss:[ebp+0x330D74C0], al
0050782A    shr byte ptr ds:[edx], cl
0050782D    lea ecx, ds:[edx+0x03]
00507830    call 0x00561AF0                                 ; => [ Call: sub_561af0 ]
00507835    pop ecx
00507836    ret
