// ============================================================
// 函数名称: sub_4a8390
// 起始地址: 0x4a8390
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A8390    push 0x801800
004A8395    push 0x00
004A8397    push 0x00
004A8399    push 0x00
004A839B    push 0x1F
004A839D    mov ecx, 0x1777504
004A83A2    call 0x006B7CB0
004A83A7    ret                                             ; => [ Data: data_801800 | Call: sub_6b7cb0 ]
