// ============================================================
// 函数名称: sub_7683f6
// 起始地址: 0x7683f6
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007683F6    mov eax, dword ptr ss:[ebp-0x84]
007683FC    and eax, 0x40000000
00768401    jz 0x00768419
00768407    and dword ptr ss:[ebp-0x84], 0xBFFFFFFF
00768411    mov ecx, dword ptr ss:[ebp-0x6C]
00768414    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00768419    ret
