// ============================================================
// 函数名称: sub_768169
// 起始地址: 0x768169
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768169    mov eax, dword ptr ss:[ebp-0x7C]
0076816C    and eax, 0x40
0076816F    jz 0x00768181
00768175    and dword ptr ss:[ebp-0x7C], 0xFFFFFFBF
00768179    mov ecx, dword ptr ss:[ebp-0x6C]
0076817C    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00768181    ret
