// ============================================================
// 函数名称: sub_764490
// 起始地址: 0x764490
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00764490    mov eax, dword ptr ss:[ebp-0x34]
00764493    and eax, 0x01
00764496    jz 0x007644A8
0076449C    and dword ptr ss:[ebp-0x34], 0xFFFFFFFE
007644A0    mov ecx, dword ptr ss:[ebp-0x40]
007644A3    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007644A8    ret
