// ============================================================
// 函数名称: sub_766889
// 起始地址: 0x766889
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766889    push 0x4F8780
0076688E    push 0x02
00766890    push 0x30
00766892    lea eax, ss:[ebp-0xD0]
00766898    push eax
00766899    call 0x007592FC
0076689E    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
