// ============================================================
// 函数名称: sub_765400
// 起始地址: 0x765400
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00765400    push 0x4F8780
00765405    push 0x02
00765407    push 0x30
00765409    lea eax, ss:[ebp-0x70]
0076540C    push eax
0076540D    call 0x007592FC
00765412    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
