// ============================================================
// 函数名称: sub_476000
// 起始地址: 0x476000
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00476000    mov edx, 0x03
00476005    mov ecx, 0x832390
0047600A    call 0x0069F030                                 ; => [ String: res/card_gen/rising_sun/credit.texture | Call: sub_69f030 ]
0047600F    mov dword ptr ds:[0x0171D754], eax              ; => [ Data: data_171d754 ]
00476014    ret
