// ============================================================
// 函数名称: sub_474010
// 起始地址: 0x474010
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00474010    mov edx, 0x03
00474015    mov ecx, 0x82F688
0047401A    call 0x0069F030                                 ; => [ String: res/card_gen/nocturne/fool.texture | Call: sub_69f030 ]
0047401F    mov dword ptr ds:[0x0171D364], eax              ; => [ Data: data_171d364 ]
00474024    ret
