// ============================================================
// 函数名称: sub_771220
// 起始地址: 0x771220
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00771220    mov eax, dword ptr ss:[ebp-0x10]
00771223    and eax, 0x01
00771226    jz 0x00771238
0077122C    and dword ptr ss:[ebp-0x10], 0xFFFFFFFE
00771230    mov ecx, dword ptr ss:[ebp-0x18]
00771233    jmp 0x004AB280                                  ; => [ Call: sub_4ab280 ]
00771238    ret
