// ============================================================
// 函数名称: sub_554820
// 起始地址: 0x554820
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00554820    dword 83EC8B55
00554824    in al, 0xF8
00554826    push ecx
00554827    push 0x00
00554829    push 0x02
0055482B    xor edx, edx
0055482D    mov ecx, 0x3E9
00554832    call 0x00568960                                 ; => [ Call: sub_568960 ]
00554837    push 0x00
00554839    xor edx, edx
0055483B    mov ecx, eax
0055483D    call 0x00561AF0
00554842    add esp, 0x10
00554845    mov esp, ebp
00554847    pop ebp
00554848    ret                                             ; => [ Call: sub_561af0 ]
