// ============================================================
// 函数名称: sub_484430
// 起始地址: 0x484430
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484430    mov edx, 0x22
00484435    mov ecx, 0x853E98
0048443A    call 0x0069F030                                 ; => [ String: res/ui2/profiles_manage.ui2 | Call: sub_69f030 ]
0048443F    mov dword ptr ds:[0x0171E884], eax              ; => [ Data: data_171e884 ]
00484444    ret
