// ============================================================
// 函数名称: sub_768217
// 起始地址: 0x768217
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768217    mov eax, dword ptr ss:[ebp-0x7C]
0076821A    and eax, 0x02
0076821D    jz 0x0076822F
00768223    and dword ptr ss:[ebp-0x7C], 0xFFFFFFFD
00768227    mov ecx, dword ptr ss:[ebp-0x6C]
0076822A    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076822F    ret
