// ============================================================
// 函数名称: sub_766876
// 起始地址: 0x766876
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766876    push 0x4F8780
0076687B    push 0x02
0076687D    push 0x30
0076687F    lea eax, ss:[ebp-0x70]
00766882    push eax
00766883    call 0x007592FC
00766888    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
