// ============================================================
// 函数名称: sub_768357
// 起始地址: 0x768357
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768357    mov eax, dword ptr ss:[ebp-0x84]
0076835D    and eax, 0x80000000
00768362    jz 0x0076837A
00768368    and dword ptr ss:[ebp-0x84], 0x7FFFFFFF
00768372    mov ecx, dword ptr ss:[ebp-0x6C]
00768375    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076837A    ret
