// ============================================================
// 函数名称: sub_76c451
// 起始地址: 0x76c451
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076C451    mov eax, dword ptr ss:[ebp-0x14]
0076C454    and eax, 0x02
0076C457    jz 0x0076C469
0076C45D    and dword ptr ss:[ebp-0x14], 0xFFFFFFFD
0076C461    lea ecx, ss:[ebp-0x18]
0076C464    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076C469    ret
