// ============================================================
// 函数名称: sub_484b70
// 起始地址: 0x484b70
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484B70    mov edx, 0x22
00484B75    mov ecx, 0x854624
00484B7A    call 0x0069F030                                 ; => [ String: res/ui2/set_gallery.ui2 | Call: sub_69f030 ]
00484B7F    mov dword ptr ds:[0x0171E958], eax              ; => [ Data: data_171e958 ]
00484B84    ret
