// ============================================================
// 函数名称: sub_770600
// 起始地址: 0x770600
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770600    mov eax, dword ptr ss:[ebp-0x20]
00770603    and eax, 0x01
00770606    jz 0x00770618
0077060C    and dword ptr ss:[ebp-0x20], 0xFFFFFFFE
00770610    mov ecx, dword ptr ss:[ebp-0x1C]
00770613    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770618    ret
