// ============================================================
// 函数名称: sub_568c20
// 起始地址: 0x568c20
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00568C20    push ebp
00568C21    mov ebp, esp
00568C23    and esp, 0xFFFFFFF8
00568C26    push ecx
00568C27    push 0x00
00568C29    push 0x00
00568C2B    call 0x00568960
00568C30    add esp, 0x0C
00568C33    mov esp, ebp
00568C35    pop ebp
00568C36    ret                                             ; => [ Call: sub_568960 ]
