// ============================================================
// 函数名称: sub_4844a0
// 起始地址: 0x4844a0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004844A0    mov edx, 0x22
004844A5    mov ecx, 0x853F00
004844AA    call 0x0069F030                                 ; => [ String: res/ui2/rules_adventures_2.ui2 | Call: sub_69f030 ]
004844AF    mov dword ptr ds:[0x0171E890], eax              ; => [ Data: data_171e890 ]
004844B4    ret
