// ============================================================
// 函数名称: sub_484540
// 起始地址: 0x484540
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484540    mov edx, 0x22
00484545    mov ecx, 0x853F98
0048454A    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_1.ui2 | Call: sub_69f030 ]
0048454F    mov dword ptr ds:[0x0171E8A4], eax              ; => [ Data: data_171e8a4 ]
00484554    ret
