// ============================================================
// 函数名称: sub_484500
// 起始地址: 0x484500
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484500    mov edx, 0x22
00484505    mov ecx, 0x853F60
0048450A    call 0x0069F030                                 ; => [ String: res/ui2/rules_alchemy_1.ui2 | Call: sub_69f030 ]
0048450F    mov dword ptr ds:[0x0171E89C], eax              ; => [ Data: data_171e89c ]
00484514    ret
