// ============================================================
// 函数名称: sub_5359d0
// 起始地址: 0x5359d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005359D0    dword 6AD233
005359D4    lea ecx, ds:[edx+0x02]
005359D7    call 0x00561AF0
005359DC    push 0x01
005359DE    push 0x00
005359E0    push 0x535A00
005359E5    mov edx, 0x534320
005359EA    mov ecx, 0x06
005359EF    call 0x0056C1B0
005359F4    add esp, 0x10
005359F7    ret                                             ; => [ Call: sub_56c1b0 | Call: sub_534320 | Call: sub_535a00 | Call: sub_561af0 ]
