// ============================================================
// 函数名称: sub_4843d0
// 起始地址: 0x4843d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004843D0    mov edx, 0x22
004843D5    mov ecx, 0x853E54
004843DA    call 0x0069F030                                 ; => [ String: res/ui2/privacy.ui2 | Call: sub_69f030 ]
004843DF    mov dword ptr ds:[0x0171E878], eax              ; => [ Data: data_171e878 ]
004843E4    ret
