// ============================================================
// 函数名称: sub_512760
// 起始地址: 0x512760
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00512760    dword 83EC8B55
00512764    in al, 0xF8
00512766    sub esp, 0xC88
0051276C    push 0x01
0051276E    lea eax, ss:[esp+0x04]
00512772    mov dword ptr ss:[esp+0x04], 0x00
0051277A    push eax
0051277B    push 0x10000
00512780    push 0x00
00512782    mov edx, 0x5127A0
00512787    mov ecx, 0x0B
0051278C    call 0x0056C680
00512791    add esp, 0x10
00512794    mov esp, ebp
00512796    pop ebp
00512797    ret                                             ; => [ Call: sub_5127a0 | Call: sub_56c680 ]
