// ============================================================
// 函数名称: sub_770231
// 起始地址: 0x770231
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770231    mov eax, dword ptr ss:[ebp-0x20]
00770234    and eax, 0x02
00770237    jz 0x00770249
0077023D    and dword ptr ss:[ebp-0x20], 0xFFFFFFFD
00770241    lea ecx, ss:[ebp-0x18]
00770244    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770249    ret
