// ============================================================
// 函数名称: sub_478510
// 起始地址: 0x478510
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478510    mov edx, 0x12
00478515    mov ecx, 0x837BC0
0047851A    call 0x0069F030                                 ; => [ String: res/font/times_new_roman_36.font | Call: sub_69f030 ]
0047851F    mov dword ptr ds:[0x0171D8F8], eax              ; => [ Data: data_171d8f8 ]
00478524    ret
