// ============================================================
// 函数名称: sub_7654f0
// 起始地址: 0x7654f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007654F0    mov eax, dword ptr ss:[ebp-0x18]
007654F3    and eax, 0x01
007654F6    jz 0x00765508
007654FC    and dword ptr ss:[ebp-0x18], 0xFFFFFFFE
00765500    mov ecx, dword ptr ss:[ebp-0x1C]
00765503    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00765508    ret
