// ============================================================
// 函数名称: sub_513d00
// 起始地址: 0x513d00
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00513D00    push ebp
00513D01    mov ebp, esp
00513D03    and esp, 0xFFFFFFF8
00513D06    push 0x00
00513D08    push 0x02
00513D0A    call 0x0056E820
00513D0F    add esp, 0x08
00513D12    mov esp, ebp
00513D14    pop ebp
00513D15    ret                                             ; => [ Call: sub_56e820 ]
