// ============================================================
// 函数名称: sub_4845f0
// 起始地址: 0x4845f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004845F0    mov edx, 0x22
004845F5    mov ecx, 0x854040
004845FA    call 0x0069F030                                 ; => [ String: res/ui2/rules_base_6.ui2 | Call: sub_69f030 ]
004845FF    mov dword ptr ds:[0x0171E8B8], eax              ; => [ Data: data_171e8b8 ]
00484604    ret
