// ============================================================
// 函数名称: sub_5444e0
// 起始地址: 0x5444e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005444E0    dword 6AD233
005444E4    lea ecx, ds:[edx+0x01]
005444E7    call 0x00561AF0                                 ; => [ Call: sub_561af0 ]
005444EC    add esp, 0x04
005444EF    xor edx, edx
005444F1    lea ecx, ds:[edx+0x07]
005444F4    jmp 0x00562F10                                  ; => [ Call: sub_562f10 ]
