// ============================================================
// 函数名称: sub_484c10
// 起始地址: 0x484c10
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484C10    mov edx, 0x22
00484C15    mov ecx, 0x8546F0
00484C1A    call 0x0069F030                                 ; => [ String: res/ui2/stats.ui2 | Call: sub_69f030 ]
00484C1F    mov dword ptr ds:[0x0171E964], eax              ; => [ Data: data_171e964 ]
00484C24    ret
