// ============================================================
// 函数名称: sub_762c80
// 起始地址: 0x762c80
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00762C80    mov eax, dword ptr ss:[ebp-0x920]
00762C86    and eax, 0x01
00762C89    jz 0x00762CA1
00762C8F    and dword ptr ss:[ebp-0x920], 0xFFFFFFFE
00762C96    lea ecx, ss:[ebp-0x910]
00762C9C    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00762CA1    ret
