// ============================================================
// 函数名称: sub_478620
// 起始地址: 0x478620
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478620    mov edx, 0x15
00478625    mov ecx, 0x837D94
0047862A    call 0x0069F030                                 ; => [ String: res/music/base.sound | Call: sub_69f030 ]
0047862F    mov dword ptr ds:[0x0171D908], eax              ; => [ Data: data_171d908 ]
00478634    ret
