// ============================================================
// 函数名称: sub_767640
// 起始地址: 0x767640
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00767640    mov eax, dword ptr ss:[ebp-0x1C]
00767643    and eax, 0x01
00767646    jz 0x00767658
0076764C    and dword ptr ss:[ebp-0x1C], 0xFFFFFFFE
00767650    mov ecx, dword ptr ss:[ebp-0x18]
00767653    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00767658    ret
