// ============================================================
// 函数名称: sub_4a82d0
// 起始地址: 0x4a82d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A82D0    push 0x801800
004A82D5    push 0x00
004A82D7    push 0x00
004A82D9    push 0x00
004A82DB    push 0x17
004A82DD    mov ecx, 0x172403E
004A82E2    call 0x006B7CB0
004A82E7    ret                                             ; => [ Data: data_801800 | Call: sub_6b7cb0 ]
