// ============================================================
// 函数名称: sub_768060
// 起始地址: 0x768060
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768060    mov eax, dword ptr ss:[ebp-0x7C]
00768063    and eax, 0x10
00768066    jz 0x00768078
0076806C    and dword ptr ss:[ebp-0x7C], 0xFFFFFFEF
00768070    mov ecx, dword ptr ss:[ebp-0x6C]
00768073    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00768078    ret
