// ============================================================
// 函数名称: sub_770820
// 起始地址: 0x770820
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770820    mov eax, dword ptr ss:[ebp-0x128]
00770826    and eax, 0x08
00770829    jz 0x00770841
0077082F    and dword ptr ss:[ebp-0x128], 0xFFFFFFF7
00770836    lea ecx, ss:[ebp-0x11C]
0077083C    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00770841    ret
