// ============================================================
// 函数名称: sub_484930
// 起始地址: 0x484930
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484930    mov edx, 0x22
00484935    mov ecx, 0x854380
0048493A    call 0x0069F030                                 ; => [ String: res/ui2/rules_nocturne_3.ui2 | Call: sub_69f030 ]
0048493F    mov dword ptr ds:[0x0171E91C], eax              ; => [ Data: data_171e91c ]
00484944    ret
