// ============================================================
// 函数名称: sub_484c30
// 起始地址: 0x484c30
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484C30    mov edx, 0x22
00484C35    mov ecx, 0x854704
00484C3A    call 0x0069F030                                 ; => [ String: res/ui2/store.ui2 | Call: sub_69f030 ]
00484C3F    mov dword ptr ds:[0x0171E968], eax              ; => [ Data: data_171e968 ]
00484C44    ret
