// ============================================================
// 函数名称: sub_4848f0
// 起始地址: 0x4848f0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004848F0    mov edx, 0x22
004848F5    mov ecx, 0x854340
004848FA    call 0x0069F030                                 ; => [ String: res/ui2/rules_nocturne_1.ui2 | Call: sub_69f030 ]
004848FF    mov dword ptr ds:[0x0171E914], eax              ; => [ Data: data_171e914 ]
00484904    ret
