// ============================================================
// 函数名称: sub_484140
// 起始地址: 0x484140
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484140    mov edx, 0x22
00484145    mov ecx, 0x853B60
0048414A    call 0x0069F030                                 ; => [ String: res/ui2/loading_screen.ui2 | Call: sub_69f030 ]
0048414F    mov dword ptr ds:[0x0171E838], eax              ; => [ Data: data_171e838 ]
00484154    ret
