// ============================================================
// 函数名称: sub_7708e4
// 起始地址: 0x7708e4
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007708E4    mov eax, dword ptr ss:[ebp-0x128]
007708EA    and eax, 0x100
007708EF    jz 0x0077090A
007708F5    and dword ptr ss:[ebp-0x128], 0xFFFFFEFF
007708FF    lea ecx, ss:[ebp-0x11C]
00770905    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0077090A    ret
