// ============================================================
// 函数名称: sub_770799
// 起始地址: 0x770799
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00770799    mov eax, dword ptr ss:[ebp-0x128]
0077079F    and eax, 0x02
007707A2    jz 0x007707BA
007707A8    and dword ptr ss:[ebp-0x128], 0xFFFFFFFD
007707AF    lea ecx, ss:[ebp-0x11C]
007707B5    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007707BA    ret
