// ============================================================
// 函数名称: sub_530110
// 起始地址: 0x530110
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00530110    dword 83EC8B55
00530114    in al, 0xF8
00530116    call 0x0056CFC0                                 ; => [ Call: sub_56cfc0 ]
0053011B    call 0x0052F1D0
00530120    mov esp, ebp
00530122    pop ebp
00530123    ret                                             ; => [ Call: sub_52f1d0 ]
