// ============================================================
// 函数名称: sub_7630a0
// 起始地址: 0x7630a0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007630A0    mov eax, dword ptr ss:[ebp-0x1C]
007630A3    and eax, 0x02
007630A6    jz 0x007630B8
007630AC    and dword ptr ss:[ebp-0x1C], 0xFFFFFFFD
007630B0    lea ecx, ss:[ebp-0x18]
007630B3    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
007630B8    ret
