// ============================================================
// 函数名称: sub_765000
// 起始地址: 0x765000
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00765000    push 0x4F8780
00765005    push 0x04
00765007    push 0x30
00765009    lea eax, ss:[ebp-0xD0]
0076500F    push eax
00765010    call 0x007592FC
00765015    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
