// ============================================================
// 函数名称: sub_555490
// 起始地址: 0x555490
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00555490    dword 6AD233
00555494    lea ecx, ds:[edx+0x02]
00555497    call 0x00561AF0
0055549C    push 0x01
0055549E    push 0x02
005554A0    push 0x5554C0
005554A5    mov edx, 0x5337B0
005554AA    mov ecx, 0x06
005554AF    call 0x0056C1B0
005554B4    add esp, 0x10
005554B7    ret                                             ; => [ Call: sub_5554c0 | Call: sub_56c1b0 | Call: sub_5337b0 | Call: sub_561af0 ]
