// ============================================================
// 函数名称: sub_764758
// 起始地址: 0x764758
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00764758    mov eax, dword ptr ss:[ebp-0x14]
0076475B    and eax, 0x01
0076475E    jz 0x00764770
00764764    and dword ptr ss:[ebp-0x14], 0xFFFFFFFE
00764768    mov ecx, dword ptr ss:[ebp-0x18]
0076476B    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00764770    ret
