// ============================================================
// 函数名称: sub_484e30
// 起始地址: 0x484e30
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484E30    mov edx, 0x22
00484E35    mov ecx, 0x854A1C
00484E3A    call 0x0069F030                                 ; => [ String: res/ui2/title_bg.ui2 | Call: sub_69f030 ]
00484E3F    mov dword ptr ds:[0x0171E984], eax              ; => [ Data: data_171e984 ]
00484E44    ret
