// ============================================================
// 函数名称: sub_483f70
// 起始地址: 0x483f70
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00483F70    mov edx, 0x22
00483F75    mov ecx, 0x853970
00483F7A    call 0x0069F030                                 ; => [ String: res/ui2/daily_seed.ui2 | Call: sub_69f030 ]
00483F7F    mov dword ptr ds:[0x0171E80C], eax              ; => [ Data: data_171e80c ]
00483F84    ret
