// ============================================================
// 函数名称: sub_484780
// 起始地址: 0x484780
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484780    mov edx, 0x22
00484785    mov ecx, 0x8541B8
0048478A    call 0x0069F030                                 ; => [ String: res/ui2/rules_exp14_allies_1.ui2 | Call: sub_69f030 ]
0048478F    mov dword ptr ds:[0x0171E8E8], eax              ; => [ Data: data_171e8e8 ]
00484794    ret
