// ============================================================
// 函数名称: sub_76b743
// 起始地址: 0x76b743
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076B743    mov eax, dword ptr ss:[ebp-0x14]
0076B746    and eax, 0x08
0076B749    jz 0x0076B75B
0076B74F    and dword ptr ss:[ebp-0x14], 0xFFFFFFF7
0076B753    lea ecx, ss:[ebp-0x38]
0076B756    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076B75B    ret
