// ============================================================
// 函数名称: sub_484a90
// 起始地址: 0x484a90
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484A90    mov edx, 0x22
00484A95    mov ecx, 0x854508
00484A9A    call 0x0069F030                                 ; => [ String: res/ui2/rules_seaside_2.ui2 | Call: sub_69f030 ]
00484A9F    mov dword ptr ds:[0x0171E944], eax              ; => [ Data: data_171e944 ]
00484AA4    ret
