// ============================================================
// 函数名称: sub_484720
// 起始地址: 0x484720
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484720    mov edx, 0x22
00484725    mov ecx, 0x854164
0048472A    call 0x0069F030                                 ; => [ String: res/ui2/rules_empires_3.ui2 | Call: sub_69f030 ]
0048472F    mov dword ptr ds:[0x0171E8DC], eax              ; => [ Data: data_171e8dc ]
00484734    ret
