// ============================================================
// 函数名称: sub_768101
// 起始地址: 0x768101
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768101    mov eax, dword ptr ss:[ebp-0x84]
00768107    and eax, 0x800000
0076810C    jz 0x00768124
00768112    and dword ptr ss:[ebp-0x84], 0xFF7FFFFF
0076811C    mov ecx, dword ptr ss:[ebp-0x6C]
0076811F    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00768124    ret
