// ============================================================
// 函数名称: sub_478570
// 起始地址: 0x478570
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00478570    mov edx, 0x12
00478575    mov ecx, 0x837C64
0047857A    call 0x0069F030                                 ; => [ String: res/font/times_new_roman_italic36.font | Call: sub_69f030 ]
0047857F    mov dword ptr ds:[0x0171D900], eax              ; => [ Data: data_171d900 ]
00478584    ret
