// ============================================================
// 函数名称: sub_538960
// 起始地址: 0x538960
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00538960    dword B9D233
00538964    add dword ptr ds:[eax], eax
00538966    add al, ch
00538968    mov ah, 0xAE
0053896A    add al, byte ptr ds:[eax]
0053896C    xor ecx, ecx
0053896E    cmp al, 0x01
00538970    setnz cl                                        ; => [ Call: sub_563820 ]
00538973    mov eax, ecx
00538975    ret
