// ============================================================
// 函数名称: sub_484360
// 起始地址: 0x484360
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484360    mov edx, 0x22
00484365    mov ecx, 0x853DC4
0048436A    call 0x0069F030                                 ; => [ String: res/ui2/pause_menu.ui2 | Call: sub_69f030 ]
0048436F    mov dword ptr ds:[0x0171E870], eax              ; => [ Data: data_171e870 ]
00484374    ret
