// ============================================================
// 函数名称: sub_484460
// 起始地址: 0x484460
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484460    mov edx, 0x22
00484465    mov ecx, 0x853ECC
0048446A    call 0x0069F030                                 ; => [ String: res/ui2/rules.ui2 | Call: sub_69f030 ]
0048446F    mov dword ptr ds:[0x0171E888], eax              ; => [ Data: data_171e888 ]
00484474    ret
