// ============================================================
// 函数名称: sub_474110
// 起始地址: 0x474110
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00474110    mov edx, 0x03
00474115    mov ecx, 0x82F7B8
0047411A    call 0x0069F030                                 ; => [ String: res/card_gen/nocturne/lamp.texture | Call: sub_69f030 ]
0047411F    mov dword ptr ds:[0x0171D384], eax              ; => [ Data: data_171d384 ]
00474124    ret
