// ============================================================
// 函数名称: sub_484310
// 起始地址: 0x484310
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484310    mov edx, 0x22
00484315    mov ecx, 0x853D70
0048431A    call 0x0069F030                                 ; => [ String: res/ui2/number_picker.ui2 | Call: sub_69f030 ]
0048431F    mov dword ptr ds:[0x0171E868], eax              ; => [ Data: data_171e868 ]
00484324    ret
