// ============================================================
// 函数名称: sub_76b775
// 起始地址: 0x76b775
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076B775    mov eax, dword ptr ss:[ebp-0x14]
0076B778    and eax, 0x20
0076B77B    jz 0x0076B78D
0076B781    and dword ptr ss:[ebp-0x14], 0xFFFFFFDF
0076B785    lea ecx, ss:[ebp-0x48]
0076B788    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076B78D    ret
