// ============================================================
// 函数名称: sub_766550
// 起始地址: 0x766550
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00766550    push 0x4F8780
00766555    push 0x02
00766557    push 0x30
00766559    lea eax, ss:[ebp-0x70]
0076655C    push eax
0076655D    call 0x007592FC
00766562    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
