// ============================================================
// 函数名称: sub_472940
// 起始地址: 0x472940
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00472940    mov edx, 0x03
00472945    mov ecx, 0x82D720
0047294A    call 0x0069F030                                 ; => [ String: res/card_gen/empires/rocks.texture | Call: sub_69f030 ]
0047294F    mov dword ptr ds:[0x0171D090], eax              ; => [ Data: data_171d090 ]
00472954    ret
