// ============================================================
// 函数名称: sub_544500
// 起始地址: 0x544500
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00544500    dword 83EC8B55
00544504    in al, 0xF8
00544506    push ecx
00544507    push 0x00
00544509    push 0x00
0054450B    mov edx, 0x101
00544510    xor ecx, ecx
00544512    call 0x00568960
00544517    add esp, 0x0C
0054451A    mov esp, ebp
0054451C    pop ebp
0054451D    ret                                             ; => [ Call: sub_568960 ]
