// ============================================================
// 函数名称: sub_484250
// 起始地址: 0x484250
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484250    mov edx, 0x22
00484255    mov ecx, 0x853C60
0048425A    call 0x0069F030                                 ; => [ String: res/ui2/msg_box_resign.ui2 | Call: sub_69f030 ]
0048425F    mov dword ptr ds:[0x0171E858], eax              ; => [ Data: data_171e858 ]
00484264    ret
