// ============================================================
// 函数名称: sub_484690
// 起始地址: 0x484690
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484690    mov edx, 0x22
00484695    mov ecx, 0x8540D0
0048469A    call 0x0069F030                                 ; => [ String: res/ui2/rules_darkages_1.ui2 | Call: sub_69f030 ]
0048469F    mov dword ptr ds:[0x0171E8CC], eax              ; => [ Data: data_171e8cc ]
004846A4    ret
