// ============================================================
// 函数名称: sub_484f00
// 起始地址: 0x484f00
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484F00    mov edx, 0x22
00484F05    mov ecx, 0x854AE4
00484F0A    call 0x0069F030                                 ; => [ String: res/ui2/twitter_card.ui2 | Call: sub_69f030 ]
00484F0F    mov dword ptr ds:[0x0171E998], eax              ; => [ Data: data_171e998 ]
00484F14    ret
