// ============================================================
// 函数名称: sub_4848d0
// 起始地址: 0x4848d0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004848D0    mov edx, 0x22
004848D5    mov ecx, 0x854320
004848DA    call 0x0069F030                                 ; => [ String: res/ui2/rules_menagerie_5.ui2 | Call: sub_69f030 ]
004848DF    mov dword ptr ds:[0x0171E910], eax              ; => [ Data: data_171e910 ]
004848E4    ret
