// ============================================================
// 函数名称: sub_484e50
// 起始地址: 0x484e50
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484E50    mov edx, 0x22
00484E55    mov ecx, 0x854A34
00484E5A    call 0x0069F030                                 ; => [ String: res/ui2/title_menu.ui2 | Call: sub_69f030 ]
00484E5F    mov dword ptr ds:[0x0171E988], eax              ; => [ Data: data_171e988 ]
00484E64    ret
