// ============================================================
// 函数名称: sub_514760
// 起始地址: 0x514760
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00514760    push esi
00514761    call 0x00573400                                 ; => [ Call: sub_573400 ]
00514766    mov esi, eax
00514768    cmp dword ptr ds:[esi+0x40], 0x00
0051476C    jnz 0x00514773
0051476E    call 0x00591930                                 ; => [ Call: sub_591930 ]
00514773    mov ecx, dword ptr ds:[esi+0x40]
00514776    pop esi
00514777    jmp 0x00514590                                  ; => [ Call: sub_514590 ]
