// ============================================================
// 函数名称: sub_538380
// 起始地址: 0x538380
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00538380    dword 83EC8B55
00538384    in al, 0xF8
00538386    push ecx
00538387    push 0x00
00538389    push 0x00
0053838B    mov edx, 0x102
00538390    xor ecx, ecx
00538392    call 0x00568960
00538397    add esp, 0x0C
0053839A    mov esp, ebp
0053839C    pop ebp
0053839D    ret                                             ; => [ Call: sub_568960 ]
