// ============================================================
// 函数名称: sub_4a8350
// 起始地址: 0x4a8350
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

004A8350    push 0x801800
004A8355    push 0x00
004A8357    push 0x6EE230
004A835C    push 0x6EE200
004A8361    push 0x1D
004A8363    mov ecx, 0x1724A8E
004A8368    call 0x006B7CB0
004A836D    ret                                             ; => [ Call: sub_6ee230 | Data: data_801800 | Call: sub_6ee200 | Call: sub_6b7cb0 ]
