// ============================================================
// 函数名称: sub_484050
// 起始地址: 0x484050
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484050    mov edx, 0x22
00484055    mov ecx, 0x853A64
0048405A    call 0x0069F030                                 ; => [ String: res/ui2/ico_symbols.ui2 | Call: sub_69f030 ]
0048405F    mov dword ptr ds:[0x0171E820], eax              ; => [ Data: data_171e820 ]
00484064    ret
