// ============================================================
// 函数名称: sub_484910
// 起始地址: 0x484910
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484910    mov edx, 0x22
00484915    mov ecx, 0x854360
0048491A    call 0x0069F030                                 ; => [ String: res/ui2/rules_nocturne_2.ui2 | Call: sub_69f030 ]
0048491F    mov dword ptr ds:[0x0171E918], eax              ; => [ Data: data_171e918 ]
00484924    ret
