// ============================================================
// 函数名称: sub_7150e0
// 起始地址: 0x7150e0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

007150E0    push ebp
007150E1    mov ebp, esp
007150E3    mov eax, dword ptr ss:[ebp+0x08]
007150E6    mov eax, dword ptr ds:[eax+0x14]
007150E9    add eax, 0x1000000
007150EE    pop ebp
007150EF    ret                                             ; => [ Data: data_1000000 ]
