// ============================================================
// 函数名称: sub_76604c
// 起始地址: 0x76604c
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076604C    push 0x4F8780
00766051    push 0x02
00766053    push 0x30
00766055    lea eax, ss:[ebp-0x70]
00766058    push eax
00766059    call 0x007592FC
0076605E    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
