// ============================================================
// 函数名称: sub_5324a0
// 起始地址: 0x5324a0
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

005324A0    call 0x00573400                                 ; => [ Call: sub_573400 ]
005324A5    push ecx
005324A6    push 0x00
005324A8    xor edx, edx
005324AA    mov ecx, dword ptr ds:[eax+0x5C]
005324AD    call 0x00561E00
005324B2    add esp, 0x08
005324B5    ret                                             ; => [ Call: sub_561e00 ]
