// ============================================================
// 函数名称: sub_765280
// 起始地址: 0x765280
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00765280    push 0x4F8780
00765285    push 0x03
00765287    push 0x30
00765289    lea eax, ss:[ebp-0xA0]
0076528F    push eax
00765290    call 0x007592FC
00765295    ret                                             ; => [ Call: `eh vector vbase constructor iterator' | Call: sub_4f8780 ]
