// ============================================================
// 函数名称: sub_768269
// 起始地址: 0x768269
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00768269    mov eax, dword ptr ss:[ebp-0x84]
0076826F    and eax, 0x2000000
00768274    jz 0x0076828C
0076827A    and dword ptr ss:[ebp-0x84], 0xFDFFFFFF
00768284    mov ecx, dword ptr ss:[ebp-0x6C]
00768287    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
0076828C    ret
