// ============================================================
// 函数名称: sub_76924b
// 起始地址: 0x76924b
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

0076924B    mov eax, dword ptr ss:[ebp-0x48]
0076924E    and eax, 0x01
00769251    jz 0x00769266
00769257    and dword ptr ss:[ebp-0x48], 0xFFFFFFFE
0076925B    mov ecx, dword ptr ss:[ebp-0x88]
00769261    jmp 0x005B0E50                                  ; => [ Call: sub_5b0e50 ]
00769266    ret
