// ============================================================
// 函数名称: sub_513450
// 起始地址: 0x513450
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00513450    dword CC97B8B8                                  ; => [ Data: data_cc97b8 ]
00513454    add byte ptr ds:[ebx+0x74C98508], cl
0051345A    jnb 0x0DC54759
00513460    add eax, 0x10
00513463    cmp eax, 0xCC99B8
00513468    jl 0x00513455
0051346A    xor al, al
0051346C    ret
0051346D    mov al, 0x01
0051346F    ret
