// ============================================================
// 函数名称: sub_764430
// 起始地址: 0x764430
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00764430    mov eax, dword ptr ss:[ebp-0x28]
00764433    and eax, 0x01
00764436    jz 0x00764448
0076443C    and dword ptr ss:[ebp-0x28], 0xFFFFFFFE
00764440    mov ecx, dword ptr ss:[ebp-0x20]
00764443    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00764448    ret
