// ============================================================
// 函数名称: sub_772661
// 起始地址: 0x772661
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00772661    mov eax, dword ptr ss:[ebp-0x18]
00772664    and eax, 0x01
00772667    jz 0x00772679
0077266D    and dword ptr ss:[ebp-0x18], 0xFFFFFFFE
00772671    mov ecx, dword ptr ss:[ebp-0x54]
00772674    jmp 0x0063D770                                  ; => [ Call: sub_63d770 ]
00772679    ret
