// ============================================================
// 函数名称: sub_484280
// 起始地址: 0x484280
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484280    mov edx, 0x22
00484285    mov ecx, 0x853CA0
0048428A    call 0x0069F030                                 ; => [ String: res/ui2/multiplayer_games.ui2 | Call: sub_69f030 ]
0048428F    mov dword ptr ds:[0x0171E85C], eax              ; => [ Data: data_171e85c ]
00484294    ret
