// ============================================================
// 函数名称: sub_484950
// 起始地址: 0x484950
// 备注: 带有 ; => 的注释为 Binary Ninja 解析出的高级语义 Token
// ============================================================

00484950    mov edx, 0x22
00484955    mov ecx, 0x8543A0
0048495A    call 0x0069F030                                 ; => [ String: res/ui2/rules_nocturne_4.ui2 | Call: sub_69f030 ]
0048495F    mov dword ptr ds:[0x0171E920], eax              ; => [ Data: data_171e920 ]
00484964    ret
